test/hdm_trace_SUITE_data/0_cwmp_Inform.xml

    <soapenv:Envelope>
        xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:cwmp="urn:dslforum-org:cwmp-1-0"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        <soapenv:Header>
            <cwmp:ID>
                soapenv:mustUnderstand="1"
                1
                </cwmp:ID>
            </soapenv:Header>
        <soapenv:Body>
            <cwmp:Inform>
                <DeviceId>
                    xmlns="urn:dslforum-org:cwmp-1-0"
                    <Manufacturer>
                        xmlns=""
                        Alcatel
                        </Manufacturer>
                    <OUI>
                        001D4C
                        </OUI>
                    <ProductClass>
                        9365 BSR Femto
                        </ProductClass>
                    <SerialNumber>
                        4321
                        </SerialNumber>
                    </DeviceId>
                <cwmp:Event>
                    soap:arrayType="cwmp:EventStruct[2]"
                    <cwmp:EventStruct>
                        <EventCode>
                            0 BOOTSTRAP
                            </EventCode>
                        <CommandKey>
                            </CommandKey>
                        </cwmp:EventStruct>
                    <cwmp:EventStruct>
                        <EventCode>
                            1 BOOT
                            </EventCode>
                        <CommandKey>
                            </CommandKey>
                        </cwmp:EventStruct>
                    </cwmp:Event>
                <MaxEnvelopes>
                    1
                    </MaxEnvelopes>
                <CurrentTime>
                    2012-10-01T16:22:03.344Z
                    </CurrentTime>
                <RetryCount>
                    0
                    </RetryCount>
                <ParameterList>
                    soap:arrayType="cwmp:ParameterValueStruct[13]"
                    <ParameterValueStruct>
                        <Name>
                            Device.DeviceSummary
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            DeviceSummary
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.DeviceInfo.HardwareVersion
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            p1
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.DeviceInfo.SoftwareVersion
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            BCR-04-00-BSR-XMIM-06.01
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.ManagementServer.ConnectionRequestURL
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            http://10.0.2.15:8095/ConnectionRequest?command=cr&amp;sn=4321
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.ManagementServer.ParameterKey
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            ParameterKey
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.LAN.IPAddress
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            172.0.0.1
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.LAN.MACAddress
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            00-0E-35-D6-24-F7
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.Services.BSR.1.SDM.1.mimVersion
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            BCR-04-00-BSR-XMIM-02.00
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.DeviceInfo.AdditionalHardwareVersion
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            250mW
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.Services.BSR.1.RFTrace.1.iMSI
                            </Name>
                        <Value>
                            xsi:type="xsd:string"
                            iMSI
                            </Value>
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.GatewayInfo.ManufacturerOUI
                            </Name>
                        <Value/>
                            xsi:type="xsd:string"
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.GatewayInfo.ProductClass
                            </Name>
                        <Value/>
                            xsi:type="xsd:string"
                        </ParameterValueStruct>
                    <ParameterValueStruct>
                        <Name>
                            Device.GatewayInfo.SerialNumber
                            </Name>
                        <Value/>
                            xsi:type="xsd:string"
                        </ParameterValueStruct>
                    </ParameterList>
                </cwmp:Inform>
            </soapenv:Body>
        </soapenv:Envelope>
